# Assignment Start

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
# Solution
import pandas as pd

# Creating a list of data
data=[4,8,15,16,23,42]

# Creating a pandas series
series1 = pd.Series(data)

# Checking the type
print(type(series1))

# Printing the series
print(series1)

# we can also create pandas series like this 
# series1 = pd.Series(data=[4,8,15,16,23,42])

<class 'pandas.core.series.Series'>
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

The output shows that the Pandas Series has been successfully created and contains the given data.

Q.2 Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
# Solution
# Creating a list of variables containing 10 elements
my_list = [x for x in range(10)]

# Applying th pandas.Series on my_list
series2 = pd.Series(my_list)

# Printing the series
print(series2)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

The output shows that the Pandas Series has been successfully created and contains my_list.

Q3. Create a Pandas DataFrame that contains the following data:
"Name", "Age", "Gender"
"Alice", 25, "Female"
"Bob", 30, "Male"
"Claire", 27, "Female"
Then, print the DataFrame.

In [3]:
# For the given data we can create dict, lists, or a file

# Method 1 - Creating pandas DataFrame using lists
columns=["Name", "Age", "Gender"]
data=[["Alice", 25, "Female"], ["Bob", 30, "Male"], ["Claire", 27, "Female"]]
df = pd.DataFrame(columns=columns, data=data)
print(df, end = "\n\n\n")

# Method 2 - Creating pandas DataFrame using dict
data = {
    "Name":["Alice", "Bob", "Claire"],
    "Age":[25,30,27],
    "Gender":["Female", "Male", "Female"]
}
df2 = pd.DataFrame(data)
print(df2)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female


     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

The output shows that the Pandas DataFrame has been successfully created and contains the given data with the column names "Name", "Age", and "Gender".

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans. DataFrame - A DataFrame is a 2-dimensional labeled data structure that can contain columns of different data types, including numerical, categorical, and textual data. It can be thought of as a table or spreadsheet-like data structure where each row represents a single observation or record and each column represents a variable or feature.

Series - On the other hand, a Series is a one-dimensional labeled array that can contain data of any type, including numerical, categorical, and textual data. It can be thought of as a single column of a DataFrame.

In [4]:
# An example that demonstrates the difference between a DataFrame and a Series in pandas:
# Create a dictionary of Data
data = {
    "Name":["Alice", "Bob", "Claire"],
    "Age":[25,30,27],
    "Gender":["Female", "Male", "Female"]
}

# create a DataFrame from the dictionary
df = pd.DataFrame(data)

# create a Series from the 'Name' column of the DataFrame
my_series = df['Name']

# print the DataFrame and the Series
print(f"DataFrame:\n{df}", end = "\n\n")
print(f"Series :\n{my_series}")

DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Series :
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

Q.5 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans. There are many functions available in Pandas for manipulating data in a DataFrame. Here are a few common ones:
1. head() - This function is used to display the first n rows of a DataFrame. For example, you might use this function to quickly view the top rows of a large DataFrame to get an idea of its contents.
2. tail() - This function is used to display the last n rows of a DataFrame. For example, you might use this function to quickly view the bottom rows of a large DataFrame to get an idea of its contents.
3. describe() - This function provides a summary of statistics for each column in a DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values. For example, you might use this function to get a quick overview of the distribution of values in a DataFrame.
4. groupby() - This function is used to group a DataFrame by one or more columns and apply a function to the resulting groups. For example, you might use this function to group a DataFrame of sales data by month and calculate the total sales for each month.
5. merge() - This function is used to combine two or more DataFrames into a single DataFrame based on a common column. For example, you might use this function to combine a DataFrame of customer data with a DataFrame of sales data to create a single DataFrame that contains both sets of information.

In [5]:
# An example to use above functions
data = {
    "Name":["Alice", "Bob", "Claire", "Arun", "Sudh", "Dheeraj", "Raman", "Krish"],
    "Age":[25, 30, 27, 22, 23, 25, 34, 21],
    "Gender":["Female", "Male", "Female", "Male", "Male", "Male", "Male", "Male"],
    "Institutiion":["Havard", "Cambridge", None, "SLC", "Hansraj", "IGNOU", None, "IIT"]
}

# create a DataFrame from the dictionary
df = pd.DataFrame(data)

In [6]:
# Returns the first 2 rows
df.head(2)

    Name  Age  Gender Institutiion
0  Alice   25  Female       Havard
1    Bob   30    Male    Cambridge

In [7]:
# Returns the last 2 rows 
df.tail(2)

    Name  Age Gender Institutiion
6  Raman   34   Male         None
7  Krish   21   Male          IIT

In [8]:
# Describes the age column as it is the only column which dtype is integer
df.describe()

            Age
count   8.00000
mean   25.87500
std     4.35685
min    21.00000
25%    22.75000
50%    25.00000
75%    27.75000
max    34.00000

In [9]:
# Understanding groupby
df1 = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
print(df1.groupby(['Animal']).mean())

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

Empty DataFrame
Columns: [Name, Age, Gender, Institutiion, Animal, Max Speed]
Index: []

In [14]:
# Understanding merge function
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. Both Series and DataFrame are mutable in nature, while Panel has been removed from pandas since version 0.25.0.

Q7. Create a DataFrame using multiple Series. Explain with an example.